<?php

namespace Database\Seeders;

use App\Models\Product;
use App\Models\Countries;
use App\Models\Categories;
use App\Models\Attributes;
use App\Models\reviews;
use App\Models\Tags;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

use Illuminate\Database\Seeder;

class ProductSeeder extends Seeder
{
    /**
     * _run the database seeds.
     */
    public function run(): void
    {

        // Countries::insert(
        //     [
        //         [
        //             'country_name_ua' => "Бельгія",
        //             'country_name_ru' => "Бельгия",
        //             "country_id" => "1"
        //         ],
        //         [
        //             'country_name_ua' => "Китай",
        //             'country_name_ru' => "Китай",
        //             "country_id" => "2"
        //         ],
        //         [
        //             'country_name_ua' => "Чехія",
        //             'country_name_ru' => "Чехия",
        //             "country_id" => "3"
        //         ],
        //         [
        //             'country_name_ua' => "Німеччинна",
        //             'country_name_ru' => "Германия",
        //             "country_id" => "4"
        //         ],
        //         [
        //             'country_name_ua' => "Італія",
        //             'country_name_ru' => "Италия",
        //             "country_id" => "5"
        //         ],
        //         [
        //             'country_name_ua' => "Польша",
        //             'country_name_ru' => "Польша",
        //             "country_id" => "6"
        //         ],
        //         [
        //             'country_name_ua' => "Іспанія",
        //             'country_name_ru' => "Испания",
        //             "country_id" => "7"
        //         ],
        //         [
        //             'country_name_ua' => "Україна",
        //             'country_name_ru' => "Украина",
        //             "country_id" => "8"
        //         ],
        //         [
        //             'country_name_ua' => "США",
        //             'country_name_ru' => "США",
        //             "country_id" => "9"
        //         ],
        //     ]
        // );


        // reviews::create(
        //     ["review_user_id" => 1, "review_author" => "some dude", "review_product_id" => 1, 'review_plus' => "some good", 'review_minus' => "some bad", 'review_text' => "meh", 'review_admin_answer' => "Дякуэмо за відгук"]
        // );

        // reviews::create(
        //     ["review_user_id" => 2, "review_author" => "some dude", "review_product_id" => 1, 'review_plus' => "some good", 'review_minus' => "some bad", 'review_text' => "meh", 'review_admin_answer' => "Дякуэмо за відгук"]
        // );
        // reviews::create(
        //     ["review_user_id" => 3, "review_author" => "some dude", "review_product_id" => 1, 'review_plus' => "some good", 'review_minus' => "some bad", 'review_text' => "meh", 'review_admin_answer' => "Дякуэмо за відгук"]
        // );

        // Tags::create([
        //     "tag_name_ru" => "tag1RU",
        //     "tag_name_ua" => "tag1UA"
        // ]);
        // Tags::create([
        //     "tag_name_ru" => "tag2RU",
        //     "tag_name_ua" => "tag2UA"
        // ]);
        // Tags::create([
        //     "tag_name_ru" => "tag2RU",
        //     "tag_name_ua" => "tag2UA"
        // ]);

        Attributes::insert(
            [
                [
                    'atribute_id' => "1",
                    'atribute_name_ua' => "Напруга електроживлення",
                    'atribute_name_ru' => "Напряжение питания",
                    // "atribute_values_ua" => '["12В","220В","12/220В","12/24/220В","12/24В","24в"]',
                    // "atribute_values_ru" => '["12В","220В","12/220В","12/24/220В","12/24В","24в"]'
                ],
                [
                    'atribute_id' => "8",
                    'atribute_name_ua' => "Відсікач",
                    'atribute_name_ru' => "Отсекатель",
                    // "atribute_values_ua" => '["Так","Ні"]',
                    // "atribute_values_ru" => '["Да","Нет"]'
                ],
                [
                    'atribute_id' => "2",
                    'atribute_name_ua' => "Вид рідини",
                    'atribute_name_ru' => "Вид жидкости",
                    // "atribute_values_ua" => '["AdBlue","Бензин","Масло","Дизель","Бензин/Дизель","Бензин/Масло", "Дизель/Масло","Бензин/Дизель/Масло"]',
                    // "atribute_values_ru" => '["AdBlue","Бензин","Масло","Дизель","Бензин/Дизель","Бензин/Масло", "Дизель/Масло","Бензин/Дизель/Масло"]'
                ],
                [
                    'atribute_id' => "3",
                    'atribute_name_ua' => "Швидкість",
                    'atribute_name_ru' => "Скорость",

                    //         "atribute_values_ua" => '["15 л/хв","20 л/хв","25 л/хв","30 л/хв","35 л/хв","40 л/хв","45 л/хв","50 л/хв","60 л/хв",
                    // "70 л/хв","80 л/хв","100 л/хв","105 л/хв","120 л/хв","150 л/хв","200 л/хв","300 л/хв","400 л/хв"]',

                    //         "atribute_values_ru" => '["15 л/м","20 л/м","25 л/м","30 л/м","35 л/м","40 л/м","45 л/м","50 л/м","60 л/м",
                    // "70 л/м","80 л/м","100 л/м","105 л/м","120 л/м","150 л/м","200 л/м","300 л/м","400 л/м"]'
                ],
                [
                    'atribute_id' => "11",
                    'atribute_name_ua' => "Потужність",
                    'atribute_name_ru' => "Мощность",

                    //         "atribute_values_ua" => '["150 Вт", "150 Вт", "155 Вт", "300 Вт", "300 Вт", "375 Вт", "400 Вт", "550 Вт", 
                    // "550 Вт", "600 Вт", "750 Вт", "750 Вт", "800 Вт", "1000 Вт"]',
                    //         "atribute_values_ru" => '["150 Вт", "150 Вт", "155 Вт", "300 Вт", "300 Вт", "375 Вт", "400 Вт", "550 Вт", 
                    // "550 Вт", "600 Вт", "750 Вт", "750 Вт", "800 Вт", "1000 Вт"]'
                ],
                [
                    'atribute_id' => "9",
                    'atribute_name_ua' => "Ступінь фільтрації",
                    'atribute_name_ru' => "Степень фильтрации",

                    // "atribute_values_ua" => '["5 мікрон", "10 мікрон", "25 мікрон", "30 мікрон", "30 мікрон", "120 мікрон", "120 мікрон"]',
                    // "atribute_values_ru" =>  '["5 микрон", "10 микрон", "25 микрон", "30 микрон", "30 микрон", "120 микрон", "120 микрон"]'
                ],
                [
                    'atribute_id' => "7",
                    'atribute_name_ua' => "Тип лічильника",
                    'atribute_name_ru' => "Тип счётчика",

                    // "atribute_values_ua" => '["Механічний", "Електронний  ", "Механічний/електронний"]',
                    // "atribute_values_ru" =>  '["Механический", "Электронный", "Механический/электронный"]'
                ],
                [
                    'atribute_id' => "10",
                    'atribute_name_ua' => "Заборонені рідини",
                    'atribute_name_ru' => "Запрещенные жидкости",
                    // "atribute_values_ua" => '["Бензин", "Бензин/вода", "Харчові"]',
                    // "atribute_values_ru" => '["Бензин", "Бензин/вода", "Пищевые"]'
                ],
                [
                    'atribute_id' => "5",
                    'atribute_name_ua' => "Похибка",
                    'atribute_name_ru' => "Погрешность",
                    // "atribute_values_ua" => '["0.5%", "0.1%", "1%"]',
                    // "atribute_values_ru" => '["0.5%", "0.1%", "1%"]'
                ],
                [
                    'atribute_id' => "6",
                    'atribute_name_ua' => "Робоча температура",
                    'atribute_name_ru' => "Рабочая температура",
                    // "atribute_values_ua" => '["-20/+40°C", "-10/+40°C", "-10/+60°C", "-15/+50°C", "-20/+50°C", "-40/+70°C", "-60/+40°C"]',
                    // "atribute_values_ru" => '["-20/+40°C", "-10/+40°C", "-10/+60°C", "-15/+50°C", "-20/+50°C", "-40/+70°C", "-60/+40°C"]'
                ],
                [
                    'atribute_id' => "4",
                    'atribute_name_ua' => "Країна виробництва",
                    'atribute_name_ru' => "Страна производства",

                ],
                [
                    'atribute_id' => "12",
                    'atribute_name_ua' => "Виробник",
                    'atribute_name_ru' => "Производитель",

                ]

            ]
        );


        // Categories::create([
        //     'id' => '1',
        //     'category_url' => "Mini azs",
        //     'category_name_ua' => 'Міні АЗС',
        //     'category_name_ru' => 'Мини АЗС',
        //     'category_parent' => null, // Или ID родительской категории, если есть
        //     'category_h1_ua' => 'Міні АЗС для перекачування бензину дизеля масла 12В-24В-220В',
        //     'category_h1_ru' => 'Мини АЗС для перекачки бензина дизеля масла 12В-24В-220В',
        //     'category_description_tag_ua' => 'Міні АЗС - Міні АЗС спроектована для монтажу на стіну і застосовується для перекачування, роздачі і дозування дизельного палива, антифризів, рідких масел, МОР і схожих за складом, що володіють змазує здатністю рідин',
        //     'category_description_tag_ru' => 'Мини АЗС - Мини АЗС спроектирована для монтажа на стену и применяется для перекачки, раздачи и дозирования дизельного топлива, антифризов, жидких масел, СОЖ и схожих по составу, обладающих смазывающей способностью жидкостей',
        //     'category_description_ua' => '<p>Міні АЗС спроектована для монтажу на стіну і застосовується для перекачування, роздачі і дозування дизельного палива, антифризів, рідких масел, МОР і схожих за складом, що володіють змазує здатністю рідин, що не викликають корозію і окислення деталей і проточної частини установки.</p><p>Заборонено перекачування вибухонебезпечних рідин!</p><p><b>Область застосування:</b></p><p>Міні АЗС використовується для заправки будівельної, комунальної та сільськогосподарської техніки на складах ПММ, АТП, будмайданчиках.</p><p><b>Переваги:</b></p><p>Міні АЗС компактна, мобільна, зручна в застосуванні, швидко приводиться в робочий стан.</p><p>Використовується в місцях, де немає можливості заправлятися на стаціонарних АЗС.</p>',
        //     'category_description_ru' => '<div>Мини АЗС спроектирована для монтажа на стену и применяется для перекачки, раздачи и дозирования дизельного топлива, антифризов, жидких масел, СОЖ и схожих по составу, обладающих смазывающей способностью жидкостей, не вызывающих коррозию и окисление деталей и проточной части установки.</div><div><br></div><div>Запрещено перекачивание взрывоопасных жидкостей!</div><div><br></div><div><b>Область применения:</b></div><div>Мини АЗС используется для заправки строительной, коммунальной и сельскохозяйственной техники на складах ГСМ, АТП, стройплощадках.</div><div><br></div><div><b>Преимущества:</b></div><div>Мини АЗС компактна, мобильна, удобна в применении, быстро приводится в рабочее состояние.</div><div>Используется в местах, где нет возможности заправляться на стационарных АЗС.</div>'
        // ]);

        // Categories::create([
        //     'id' => '2',
        //     'category_url' => "Colonka",
        //     'category_name_ua' => 'Колонки для ДП 12/24В',
        //     'category_name_ru' => 'Колонки для ДТ 12/24В',
        //     'category_parent' => 1, // Или ID родительской категории, если есть
        //     'category_h1_ua' => 'Колонки для ДП 12/24В',
        //     'category_h1_ru' => 'Колонки для ДТ 12/24В',
        //     'category_description_tag_ua' => 'Міні АЗС - Міні АЗС спроектована для монтажу на стіну і застосовується для перекачування, роздачі і дозування дизельного палива, антифризів, рідких масел, МОР і схожих за складом, що володіють змазує здатністю рідин',
        //     'category_description_tag_ru' => 'Мини АЗС - Мини АЗС спроектирована для монтажа на стену и применяется для перекачки, раздачи и дозирования дизельного топлива, антифризов, жидких масел, СОЖ и схожих по составу, обладающих смазывающей способностью жидкостей',
        //     'category_description_ua' => '<p>Міні АЗС спроектована для монтажу на стіну і застосовується для перекачування, роздачі і дозування дизельного палива, антифризів, рідких масел, МОР і схожих за складом, що володіють змазує здатністю рідин, що не викликають корозію і окислення деталей і проточної частини установки.</p><p>Заборонено перекачування вибухонебезпечних рідин!</p><p><b>Область застосування:</b></p><p>Міні АЗС використовується для заправки будівельної, комунальної та сільськогосподарської техніки на складах ПММ, АТП, будмайданчиках.</p><p><b>Переваги:</b></p><p>Міні АЗС компактна, мобільна, зручна в застосуванні, швидко приводиться в робочий стан.</p><p>Використовується в місцях, де немає можливості заправлятися на стаціонарних АЗС.</p>',
        //     'category_description_ru' => '<div>Мини АЗС спроектирована для монтажа на стену и применяется для .
        //     перекачки, раздачи и дозирования дизельного топлива, антифризов, жидких масел, СОЖ и схожих по составу, обладающих смазывающей способностью жидкостей, не вызывающих коррозию и окисление деталей и проточной части установки.</div><div><br></div><div>Запрещено перекачивание взрывоопасных жидкостей!</div><div><br></div><div><b>Область применения:</b></div><div>Мини АЗС используется для заправки строительной, коммунальной и сельскохозяйственной техники на складах ГСМ, АТП, стройплощадках.</div><div><br></div><div><b>Преимущества:</b></div><div>Мини АЗС компактна, мобильна, удобна в применении, быстро приводится в рабочее состояние.</div><div>Используется в местах, где нет возможности заправляться на стационарных АЗС.</div>'
        // ]);
    }
}